#include<stdio.h>

int main() {
	// 1. 키보드로 입력받아서 아래와 같이 출력( 입출력, 변수 문제 )
	// 결과)
	// 이름 : 홍길동
	// 나이 : 25 세
	// 신장 : 176.3 cm
	

	// 2. 두 정수를 입력받아서 큰 수를 출력 (if ~ else 문제)
	// 단, 같은 경우는 '두 수는 같다' 라고 출력


	// 3. 입력 받은 정수의 거꾸로 수를 출력 (while 문제)
	// ex) 입력 : 123 ==> 출력 : 321


	// 4. 아래와 같이 출력
	// 찍을 별의 줄수 : 5
	//     *
	//    **
	//   ***
	//  ****
	// *****


	// 5. 10개짜리 정수 배열을 생성 후
	// 10 ~ 1 까지 배열에 채워라

	// 6. 5번에서 채운 배열을 모두 출력


	// 7. 6번을 함수로 구현하라
	// ex) printArr(배열)


	// 8. 두 정수의 값을 교환하는
	// swap() 함수를 구현


	// 9. Person 이라는 구조체를 선언
	// Person은 이름, 나이, 키를 가진다


	// 10. 9번에서 선언한 구조체로 
	// 변수 생성 후 출력


	// 11. 정수형 공간을 동적할당 받고
	// 그 공간에 10을 대입한 후 출력

}